# Information
welcome_mesg = '''Добро пожаловать в наш бот! Используйте /menu'''
help_mesg = '''Здесь будет инфа о командах бота'''
info_mesg = '''Здесь будет инфа о курсе'''

# Reply exceptions
cant_initiate_conversation = '''Для начала работы со мной напишите мне в ЛС!'''
bot_blocked = "Разблокируйте меня, чтобы продолжить диалог!"
unauthorized = 'Не удалось написать вам!'
went_wrong = 'Что-то пошло не так...'
incorrect_input = '''
Неверный ввод, попробуйте еще раз 
или напишите 'Отмена'!
Ошибка: %s.
Пример : %s.
'''

example_cp = '''
1. Название раздела и темы, к которым относится КТ
2. нумерованный список кейсов для контрольной точки.
3. Дата и время проведения контрольной точки
4. Номер аудитории 
5. Комментарий от преподавателя'''

